import sys
import time
# sys.path.append('vakyansh-tts')

from vakyansh.tts_infer.tts import TextToMel, MelToWav
from vakyansh.tts_infer.transliterate import XlitEngine
from vakyansh.tts_infer.num_to_word_on_sent import normalize_nums

import re
from scipy.io.wavfile import write

device = 'cpu'
# device = 'cuda'

print("device: " + device)


text_to_mel = TextToMel(glow_model_dir='vakyansh/tts_infer/translit_models/hindi/glow_ckp', device=device)
mel_to_wav = MelToWav(hifi_model_dir='vakyansh/tts_infer/translit_models/hindi/hifi_ckp', device=device)

def translit(text, lang):
    reg = re.compile(r'[a-zA-Z]')
    engine = XlitEngine(lang)
    words = [engine.translit_word(word, topk=1)[lang][0] if reg.match(word) else word for word in text.split()]
    updated_sent = ' '.join(words)
    return updated_sent

def run_tts(text, lang,index):
    start = time.time()
    text = text.replace('।', '.') # only for hindi models
    text_num_to_word = normalize_nums(text, lang) # converting numbers to words in lang
    text_num_to_word_and_transliterated = translit(text_num_to_word, lang) # transliterating english words to lang

    mel = text_to_mel.generate_mel(text_num_to_word_and_transliterated)
    before_writing = time.time()
    audio, sr = mel_to_wav.generate_wav(mel)
    print("At index ",index)
    
    write(filename=f'temp{index}.wav', rate=sr, data=audio) # for saving wav file, if needed
    end = time.time()
    # total time taken
    print("---------------------------------------------------------------------------------")
    print("Text - ",text)
    print("Execution time of the program before writing audio is- ", before_writing-start)
    print("Execution time of the program before mel to wav and write time- ", end-before_writing)
    print("Execution time of the program after writing audio is- ", end-start)
    print("------------------------------------------------------------------------------------------")
    return (sr, audio)

txts = ["पाँचदशक के अंत में, उनका जश्न पचासवें जन्मदिन के साथ मनाया गया।",
"पाँचदशक के अंत में, उनका जश्न पचासवें जन्मदिन के साथ मनाया गया।",
"पाँचदशक के अंत में, उनका जश्न पचासवें जन्मदिन के साथ मनाया गया।",
"पाँचदशक के अंत में, उनका जश्न पचासवें जन्मदिन के साथ मनाया गया।",
"पाँचदशक के अंत में, उनका जश्न पचासवें जन्मदिन के साथ मनाया गया।",
"पाचास किलोमीटर की यात्रा पर जाने के बाद, वह थक कर गए।",
"पाचास किलोमीटर की यात्रा पर जाने के बाद, वह थक कर गए।",
"पाचास किलोमीटर की यात्रा पर जाने के बाद, वह थक कर गए।",
"पाचास किलोमीटर की यात्रा पर जाने के बाद, वह थक कर गए।",
"पाचास किलोमीटर की यात्रा पर जाने के बाद, वह थक कर गए।",
"उन्होंने पाचास दिनों में एक नया कार्यक्रम तैयार किया।",
"उन्होंने पाचास दिनों में एक नया कार्यक्रम तैयार किया।",
"उन्होंने पाचास दिनों में एक नया कार्यक्रम तैयार किया।",
"उन्होंने पाचास दिनों में एक नया कार्यक्रम तैयार किया।",
"उन्होंने पाचास दिनों में एक नया कार्यक्रम तैयार किया।",
"साल 2050 में, यह विश्व तकनीक के क्षेत्र में प्रमुख उधारणा बनेगा।",
"साल 2050 में, यह विश्व तकनीक के क्षेत्र में प्रमुख उधारणा बनेगा।",
"साल 2050 में, यह विश्व तकनीक के क्षेत्र में प्रमुख उधारणा बनेगा।",
"साल 2050 में, यह विश्व तकनीक के क्षेत्र में प्रमुख उधारणा बनेगा।",
"साल 2050 में, यह विश्व तकनीक के क्षेत्र में प्रमुख उधारणा बनेगा।",
"जब उन्होंने पचास गुणा स्कोर किया, तो वे प्रतियोगिता में विजयी बने।",
"जब उन्होंने पचास गुणा स्कोर किया, तो वे प्रतियोगिता में विजयी बने।",
"जब उन्होंने पचास गुणा स्कोर किया, तो वे प्रतियोगिता में विजयी बने।",
"जब उन्होंने पचास गुणा स्कोर किया, तो वे प्रतियोगिता में विजयी बने।",
"जब उन्होंने पचास गुणा स्कोर किया, तो वे प्रतियोगिता में विजयी बने।",
"व्यक्तिगत विकास से समृद्धि होती है, यह आवश्यक है।",
"व्यक्तिगत विकास से समृद्धि होती है, यह आवश्यक है।",
"व्यक्तिगत विकास से समृद्धि होती है, यह आवश्यक है।",
"व्यक्तिगत विकास से समृद्धि होती है, यह आवश्यक है।",
"व्यक्तिगत विकास से समृद्धि होती है, यह आवश्यक है।",
"सफलता उसे मिलती है जो हारने के बाद भी नहीं हारता।",
"सफलता उसे मिलती है जो हारने के बाद भी नहीं हारता।",
"सफलता उसे मिलती है जो हारने के बाद भी नहीं हारता।",
"सफलता उसे मिलती है जो हारने के बाद भी नहीं हारता।",
"सफलता उसे मिलती है जो हारने के बाद भी नहीं हारता।",
"आपकी सोच आपके जीवन को बना सकती है या तोड़ सकती है।",
"आपकी सोच आपके जीवन को बना सकती है या तोड़ सकती है।",
"आपकी सोच आपके जीवन को बना सकती है या तोड़ सकती है।",
"आपकी सोच आपके जीवन को बना सकती है या तोड़ सकती है।",
"आपकी सोच आपके जीवन को बना सकती है या तोड़ सकती है।",
"प्रेरणा वो चीज़ है जो हमें अपने लक्ष्य की ओर बढ़ाती है।",
"प्रेरणा वो चीज़ है जो हमें अपने लक्ष्य की ओर बढ़ाती है।",
"प्रेरणा वो चीज़ है जो हमें अपने लक्ष्य की ओर बढ़ाती है।",
"प्रेरणा वो चीज़ है जो हमें अपने लक्ष्य की ओर बढ़ाती है।",
"प्रेरणा वो चीज़ है जो हमें अपने लक्ष्य की ओर बढ़ाती है।",
"आत्मविश्वास सफलता की कुंजी है, कभी हार नहीं मानना।",
"आत्मविश्वास सफलता की कुंजी है, कभी हार नहीं मानना।",
"आत्मविश्वास सफलता की कुंजी है, कभी हार नहीं मानना।",
"आत्मविश्वास सफलता की कुंजी है, कभी हार नहीं मानना।",
"आत्मविश्वास सफलता की कुंजी है, कभी हार नहीं मानना।",
"सफलता उनकी मिलती है जो कभी हार नहीं मानते, उनकी मेहनत कभी नहीं टूटती।",
"सफलता उनकी मिलती है जो कभी हार नहीं मानते, उनकी मेहनत कभी नहीं टूटती।",
"सफलता उनकी मिलती है जो कभी हार नहीं मानते, उनकी मेहनत कभी नहीं टूटती।",
"सफलता उनकी मिलती है जो कभी हार नहीं मानते, उनकी मेहनत कभी नहीं टूटती।",
"सफलता उनकी मिलती है जो कभी हार नहीं मानते, उनकी मेहनत कभी नहीं टूटती।",
"संवाद और सहयोग समस्याओं का समाधान आसानी से कर सकते हैं।",
"संवाद और सहयोग समस्याओं का समाधान आसानी से कर सकते हैं।",
"संवाद और सहयोग समस्याओं का समाधान आसानी से कर सकते हैं।",
"संवाद और सहयोग समस्याओं का समाधान आसानी से कर सकते हैं।",
"संवाद और सहयोग समस्याओं का समाधान आसानी से कर सकते हैं।",
"जीवन को आपके अपने तरीके से जिएं, हर पल का आनंद उठाएं।",
"जीवन को आपके अपने तरीके से जिएं, हर पल का आनंद उठाएं।",
"जीवन को आपके अपने तरीके से जिएं, हर पल का आनंद उठाएं।",
"जीवन को आपके अपने तरीके से जिएं, हर पल का आनंद उठाएं।",
"जीवन को आपके अपने तरीके से जिएं, हर पल का आनंद उठाएं।",
"सफलता की ऊँचाइयों को छूने के लिए सपनों का पीछा करो और कभी हार नहीं मानना।",
"सफलता की ऊँचाइयों को छूने के लिए सपनों का पीछा करो और कभी हार नहीं मानना।",
"सफलता की ऊँचाइयों को छूने के लिए सपनों का पीछा करो और कभी हार नहीं मानना।",
"सफलता की ऊँचाइयों को छूने के लिए सपनों का पीछा करो और कभी हार नहीं मानना।",
"सफलता की ऊँचाइयों को छूने के लिए सपनों का पीछा करो और कभी हार नहीं मानना।",
"आत्मविश्वास सफलता का महत्वपूर्ण हिस्सा है, इसे कभी हार नहीं मानना चाहिए।",
"आत्मविश्वास सफलता का महत्वपूर्ण हिस्सा है, इसे कभी हार नहीं मानना चाहिए।",
"आत्मविश्वास सफलता का महत्वपूर्ण हिस्सा है, इसे कभी हार नहीं मानना चाहिए।",
"आत्मविश्वास सफलता का महत्वपूर्ण हिस्सा है, इसे कभी हार नहीं मानना चाहिए।",
"आत्मविश्वास सफलता का महत्वपूर्ण हिस्सा है, इसे कभी हार नहीं मानना चाहिए।"
]

for index,value in enumerate(txts):
  _, audio = run_tts(value, 'hi', index)
  print("-------------Done-------------------")

# run_tts(txts, 'hi')
# """## Results"""

# import IPython.display as ipd
# ipd.Audio('temp.wav')
